Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33f/h/p33FJ128GP802.h
#define _RPINR22_SDI2R2_POSITION                 0x00000002
#define _RPINR22_SDI2R2_MASK                     0x00000004
#define _RPINR22_SDI2R2_LENGTH                   0x00000001

#define _RPINR22_SDI2R3_POSITION                 0x00000003
#define _RPINR22_SDI2R3_MASK                     0x00000008
#define _RPINR22_SDI2R3_LENGTH                   0x00000001

#define _RPINR22_SDI2R4_POSITION                 0x00000004
#define _RPINR22_SDI2R4_MASK                     0x00000010
#define _RPINR22_SDI2R4_LENGTH                   0x00000001

#define _RPINR22_SCK2R0_POSITION                 0x00000008
#define _RPINR22_SCK2R0_MASK                     0x00000100
#define _RPINR22_SCK2R0_LENGTH                   0x00000001

#define _RPINR22_SCK2R1_POSITION                 0x00000009
#define _RPINR22_SCK2R1_MASK                     0x00000200
#define _RPINR22_SCK2R1_LENGTH                   0x00000001

#define _RPINR22_SCK2R2_POSITION                 0x0000000A
#define _RPINR22_SCK2R2_MASK                     0x00000400
#define _RPINR22_SCK2R2_LENGTH                   0x00000001

#define _RPINR22_SCK2R3_POSITION                 0x0000000B
#define _RPINR22_SCK2R3_MASK                     0x00000800
#define _RPINR22_SCK2R3_LENGTH                   0x00000001

#define _RPINR22_SCK2R4_POSITION                 0x0000000C
#define _RPINR22_SCK2R4_MASK                     0x00001000
#define _RPINR22_SCK2R4_LENGTH                   0x00000001

#define _RPINR23_SS2R_POSITION                   0x00000000
#define _RPINR23_SS2R_MASK                       0x0000001F
#define _RPINR23_SS2R_LENGTH                     0x00000005

#define _RPINR23_SS2R0_POSITION                  0x00000000
#define _RPINR23_SS2R0_MASK                      0x00000001
#define _RPINR23_SS2R0_LENGTH                    0x00000001

#define _RPINR23_SS2R1_POSITION                  0x00000001
#define _RPINR23_SS2R1_MASK                      0x00000002
#define _RPINR23_SS2R1_LENGTH                    0x00000001

#define _RPINR23_SS2R2_POSITION                  0x00000002
#define _RPINR23_SS2R2_MASK                      0x00000004
#define _RPINR23_SS2R2_LENGTH                    0x00000001

#define _RPINR23_SS2R3_POSITION                  0x00000003
#define _RPINR23_SS2R3_MASK                      0x00000008
#define _RPINR23_SS2R3_LENGTH                    0x00000001

#define _RPINR23_SS2R4_POSITION                  0x00000004
#define _RPINR23_SS2R4_MASK                      0x00000010
#define _RPINR23_SS2R4_LENGTH                    0x00000001

#define _RPINR24_CSDIR_POSITION                  0x00000000
#define _RPINR24_CSDIR_MASK                      0x0000001F
#define _RPINR24_CSDIR_LENGTH                    0x00000005

#define _RPINR24_CSCKR_POSITION                  0x00000008
#define _RPINR24_CSCKR_MASK                      0x00001F00
#define _RPINR24_CSCKR_LENGTH                    0x00000005

#define _RPINR24_CSDIR0_POSITION                 0x00000000
#define _RPINR24_CSDIR0_MASK                     0x00000001
#define _RPINR24_CSDIR0_LENGTH                   0x00000001

#define _RPINR24_CSDIR1_POSITION                 0x00000001
#define _RPINR24_CSDIR1_MASK                     0x00000002
#define _RPINR24_CSDIR1_LENGTH                   0x00000001

#define _RPINR24_CSDIR2_POSITION                 0x00000002
#define _RPINR24_CSDIR2_MASK                     0x00000004
#define _RPINR24_CSDIR2_LENGTH                   0x00000001

#define _RPINR24_CSDIR3_POSITION                 0x00000003
#define _RPINR24_CSDIR3_MASK                     0x00000008
#define _RPINR24_CSDIR3_LENGTH                   0x00000001

#define _RPINR24_CSDIR4_POSITION                 0x00000004
#define _RPINR24_CSDIR4_MASK                     0x00000010
#define _RPINR24_CSDIR4_LENGTH                   0x00000001

#define _RPINR24_CSCKR0_POSITION                 0x00000008
#define _RPINR24_CSCKR0_MASK                     0x00000100
#define _RPINR24_CSCKR0_LENGTH                   0x00000001

#define _RPINR24_CSCKR1_POSITION                 0x00000009
#define _RPINR24_CSCKR1_MASK                     0x00000200
#define _RPINR24_CSCKR1_LENGTH                   0x00000001

#define _RPINR24_CSCKR2_POSITION                 0x0000000A
#define _RPINR24_CSCKR2_MASK                     0x00000400
#define _RPINR24_CSCKR2_LENGTH                   0x00000001

#define _RPINR24_CSCKR3_POSITION                 0x0000000B
#define _RPINR24_CSCKR3_MASK                     0x00000800
#define _RPINR24_CSCKR3_LENGTH                   0x00000001

#define _RPINR24_CSCKR4_POSITION                 0x0000000C
#define _RPINR24_CSCKR4_MASK                     0x00001000
#define _RPINR24_CSCKR4_LENGTH                   0x00000001

#define _RPINR25_COFSR_POSITION                  0x00000000
#define _RPINR25_COFSR_MASK                      0x0000001F
#define _RPINR25_COFSR_LENGTH                    0x00000005

#define _RPINR25_COFSR0_POSITION                 0x00000000
#define _RPINR25_COFSR0_MASK                     0x00000001
#define _RPINR25_COFSR0_LENGTH                   0x00000001

#define _RPINR25_COFSR1_POSITION                 0x00000001
#define _RPINR25_COFSR1_MASK                     0x00000002
#define _RPINR25_COFSR1_LENGTH                   0x00000001

#define _RPINR25_COFSR2_POSITION                 0x00000002
#define _RPINR25_COFSR2_MASK                     0x00000004
#define _RPINR25_COFSR2_LENGTH                   0x00000001

#define _RPINR25_COFSR3_POSITION                 0x00000003
#define _RPINR25_COFSR3_MASK                     0x00000008
#define _RPINR25_COFSR3_LENGTH                   0x00000001

#define _RPINR25_COFSR4_POSITION                 0x00000004
#define _RPINR25_COFSR4_MASK                     0x00000010
#define _RPINR25_COFSR4_LENGTH                   0x00000001

#define _RPINR26_C1RXR_POSITION                  0x00000000
#define _RPINR26_C1RXR_MASK                      0x0000001F
#define _RPINR26_C1RXR_LENGTH                    0x00000005

#define _RPINR26_C1RXR0_POSITION                 0x00000000
#define _RPINR26_C1RXR0_MASK                     0x00000001
#define _RPINR26_C1RXR0_LENGTH                   0x00000001

#define _RPINR26_C1RXR1_POSITION                 0x00000001
#define _RPINR26_C1RXR1_MASK                     0x00000002
#define _RPINR26_C1RXR1_LENGTH                   0x00000001

